local spells = {
    [384255]  = { index = 151, },              -- 切换天赋
    -- 种族
    [232633]  = { index = 101, },              -- 奥术洪流(法力)
    [129597]  = { index = 102, },              -- 奥术洪流(能量)
    -- 术士
    [5782]    = { index = 1, failed = true },  -- 恐惧
    [6789]    = { index = 2, failed = true },  -- 死亡缠绕
    [30283]   = { index = 3, failed = true },  -- 暗影之怒
    [196277]  = { index = 4, failed = true },  -- 内爆
    [265187]  = { index = 5, failed = true },  -- 召唤恶魔暴君
    [1276467] = { index = 6, failed = true },  -- 魔典：邪能破坏者
    [1276672] = { index = 7, },                -- 召唤末日守卫
    [105174]  = { index = 8, },                -- 古尔丹之手
    [104316]  = { index = 9, },                -- 召唤恐惧猎犬
    [30146]   = { index = 10, },               -- 召唤恶魔卫士
    [264178]  = { index = 11, },               -- 恶魔之箭
    [686]     = { index = 12, },               -- 暗影箭
    [691]     = { index = 13, },               -- 召唤地狱猎犬
    [688]     = { index = 14, },               -- 召唤小鬼
    [1271748] = { index = 15, },               -- 虚弱灾厄
    [1271802] = { index = 16, },               -- 语言灾厄
    [434635]  = { index = 17, },               -- 陨灭(古尔丹之手)
    [434506]  = { index = 18, },               -- 狱火箭(暗影箭)
    [20707]   = { index = 19, },               -- 灵魂石
    [333889]  = { index = 20, },               -- 邪能统御
    [108416]  = { index = 21, },               -- 黑暗契约
    [264187]  = { index = 22, },               -- 恶魔之箭
    [1276452] = { index = 23, },               -- 魔典：小鬼领主
    [132409]  = { index = 24, },               -- 法术封锁
    -- 牧师
    [8122]    = { index = 1, failed = true },  -- 心灵尖啸
    [32375]   = { index = 2, failed = true },  -- 群体驱散
    [62618]   = { index = 3, failed = true },  -- 真言术：障
    [421453]  = { index = 4, failed = true },  -- 终极苦修
    [200183]  = { index = 5, failed = true },  -- 神圣化身
    [120517]  = { index = 6, failed = true },  -- 光晕
    [64843]   = { index = 7, failed = true },  -- 神圣赞美诗
    [228260]  = { index = 8, failed = true },  -- 虚空形态
    [15286]   = { index = 9, failed = true },  -- 吸血鬼的拥抱
    [21562]   = { index = 10, },               -- 真言术：韧
    [8092]    = { index = 11, },               -- 心灵震爆
    [585]     = { index = 12, },               -- 惩击
    [32379]   = { index = 13, },               -- 暗言术：灭
    [589]     = { index = 14, },               -- 暗言术：痛
    [47540]   = { index = 15, },               -- 苦修
    [88625]   = { index = 16, },               -- 圣言术：罚
    [14914]   = { index = 17, },               -- 神圣之火
    [132157]  = { index = 18, },               -- 神圣新星
    [34914]   = { index = 19, },               -- 吸血鬼之触
    [232698]  = { index = 20, },               -- 暗影形态
    [335467]  = { index = 21, },               -- 暗言术：癫
    [15407]   = { index = 22, },               -- 精神鞭笞
    [263165]  = { index = 23, },               -- 虚空洪流
    [1227280] = { index = 24, },               -- 触须猛击
    [450983]  = { index = 25, },               -- 虚空冲击
    [1242173] = { index = 26, },               -- 虚空齐射
    [391403]  = { index = 27, },               -- 精神鞭笞：狂
    [120644]  = { index = 28, },               -- 光晕
    [2061]    = { index = 29, },               -- 快速治疗
    [194509]  = { index = 30, },               -- 真言术：耀
    [64863]   = { index = 31, },               -- 神圣赞美诗
    [596]     = { index = 32, },               -- 治疗祷言
    [1262763] = { index = 33, },               -- 祈福
    -- 德鲁伊
    [132469]  = { index = 1, failed = true },  -- 台风
    [99]      = { index = 2, failed = true },  -- 夺魂咆哮
    [102793]  = { index = 3, failed = true },  -- 乌索尔旋风
    [132158]  = { index = 4, failed = true },  -- 自然迅捷
    [8921]    = { index = 5, },                -- 月火术
    [1126]    = { index = 6, },                -- 野性印记
    [400254]  = { index = 7, },                -- 摧折
    [204066]  = { index = 8, },                -- 明月普照
    [213771]  = { index = 9, },                -- 横扫
    [5487]    = { index = 10, },               -- 熊形态
    [77758]   = { index = 11, },               -- 痛击
    [33917]   = { index = 12, },               -- 裂伤
    [1252871] = { index = 13, },               -- 赤红之月
    [441605]  = { index = 14, },               -- 毁灭
    [22568]   = { index = 15, },               -- 凶猛撕咬
    [1079]    = { index = 16, },               -- 割裂
    [5221]    = { index = 17, },               -- 撕碎
    [1822]    = { index = 18, },               -- 斜掠
    [5176]    = { index = 19, },               -- 愤怒
    [8936]    = { index = 20, },               -- 愈合
    [48438]   = { index = 21, },               -- 野性生长
    [740]     = { index = 22, },               -- 宁静
    -- 法师
    [110959]  = { index = 1, failed = true },  -- 强化隐形术
    [122]     = { index = 2, failed = true },  -- 冰霜新星
    [31661]   = { index = 3, failed = true },  -- 龙息术
    [1248829] = { index = 4, },                -- 暴风雪
    [190356]  = { index = 5, },                -- 暴风雪
    [1459]    = { index = 6, },                -- 奥术智慧
    [116]     = { index = 7, },                -- 寒冰箭
    [199786]  = { index = 8, },                -- 冰川尖刺
    [30455]   = { index = 9, },                -- 冰枪术
    [205021]  = { index = 10, },               -- 冰霜射线
    [44614]   = { index = 11, },               -- 冰风暴
    [84714]   = { index = 12, },               -- 寒冰宝珠
    [431044]  = { index = 13, },               -- 霜火之箭
    [153595]  = { index = 14, },               -- 彗星风暴
    -- 圣骑士
    [115750]  = { index = 1, failed = true },  -- 盲目之光
    [31821]   = { index = 2, failed = true },  -- 光环掌握
    [1044]    = { index = 3, failed = true },  -- 自由祝福
    [853]     = { index = 4, failed = true },  -- 制裁之锤
    [1022]    = { index = 5, failed = true },  -- 保护祝福
    [642]     = { index = 6, failed = true },  -- 圣盾术
    [375576]  = { index = 7, },                -- 圣洁鸣钟
    [31935]   = { index = 8, },                -- 复仇者之盾
    [26573]   = { index = 9, },                -- 奉献
    [275779]  = { index = 10, },               -- 审判
    [53600]   = { index = 11, },               -- 正义盾击
    [204019]  = { index = 12, },               -- 祝福之锤
    [184575]  = { index = 13, },               -- 公正之剑
    [20271]   = { index = 14, },               -- 审判
    [383328]  = { index = 15, },               -- 最终审判
    [255937]  = { index = 16, },               -- 灰烬觉醒
    [53385]   = { index = 17, },               -- 神圣风暴
    [427453]  = { index = 18, },               -- 圣光之锤(灰烬觉醒)
    [24275]   = { index = 19, },               -- 愤怒之锤(审判)
    [343527]  = { index = 20, },               -- 处决宣判
    [1241413] = { index = 21, },               -- 愤怒之锤(审判)
    [82326]   = { index = 22, },               -- 圣光术
    [19750]   = { index = 23, },               -- 圣光闪现
    -- 武僧
    [322109]  = { index = 1, failed = true },  -- 轮回之触
    [119381]  = { index = 2, failed = true },  -- 扫堂腿
    [101643]  = { index = 3, failed = true },  -- 魂体双分
    [119996]  = { index = 4, failed = true },  -- 转移
    [116849]  = { index = 5, failed = true },  -- 作茧缚命
    [115310]  = { index = 6, failed = true },  -- 还魂术
    [116844]  = { index = 7, failed = true },  -- 平心之环
    [115078]  = { index = 8, failed = true },  -- 分筋错骨
    [132578]  = { index = 9, failed = true },  -- 玄牛下凡
    [100780]  = { index = 10, },               -- 猛虎掌
    [322729]  = { index = 11, },               -- 神鹤引项踢
    [205523]  = { index = 12, },               -- 幻灭踢
    [325153]  = { index = 13, },               -- 爆炸酒桶
    [123986]  = { index = 14, },               -- 真气爆裂
    [121253]  = { index = 15, },               -- 醉酿投
    [115181]  = { index = 16, },               -- 火焰之息
    [116847]  = { index = 17, },               -- 碧玉疾风
    [117952]  = { index = 18, },               -- 碎玉闪电
    [101546]  = { index = 19, },               -- 神鹤引项踢
    [100784]  = { index = 20, },               -- 幻灭踢
    [113656]  = { index = 21, },               -- 怒雷破
    [107428]  = { index = 22, },               -- 旭日东升踢
    [392983]  = { index = 23, },               -- 风领主之击
    [467307]  = { index = 24, },               -- 疾风呼啸踢
    [152175]  = { index = 25, },               -- 升龙霸
    [399491]  = { index = 26, },               -- 神龙之赐
    [116670]  = { index = 27, },               -- 活血术
    [115175]  = { index = 28, },               -- 抚慰之雾
    [443028]  = { index = 29, },               -- 天神御身
    [124682]  = { index = 30, },               -- 氤氲之雾
    [115294]  = { index = 31, },               -- 法力茶
    -- 战士
    [202168]  = { index = 1, failed = true },  -- 胜利在望
    [376079]  = { index = 2, failed = true },  -- 勇士之矛
    [6544]    = { index = 3, failed = true },  -- 英勇飞跃
    [97462]   = { index = 4, failed = true },  -- 集结呐喊
    [46968]   = { index = 5, failed = true },  -- 震荡波
    [107570]  = { index = 6, failed = true },  -- 风暴之锤
    [384110]  = { index = 7, failed = true },  -- 破裂投掷
    [64382]   = { index = 8, failed = true },  -- 碎裂投掷
    [5246]    = { index = 9, failed = true },  -- 破胆怒吼
    [385952]  = { index = 10, failed = true }, -- 盾牌冲锋
    [57755]   = { index = 11, },               -- 英勇投掷
    [6673]    = { index = 12, },               -- 战斗怒吼
    [1464]    = { index = 13, },               -- 猛击
    [772]     = { index = 14, },               -- 撕裂
    [281000]  = { index = 15, },               -- 斩杀
    [227847]  = { index = 16, },               -- 剑刃风暴
    [436358]  = { index = 17, },               -- 崩摧
    [12294]   = { index = 18, },               -- 致死打击
    [167105]  = { index = 19, },               -- 巨人打击
    [845]     = { index = 20, },               -- 顺劈斩
    [7384]    = { index = 21, },               -- 压制
    [260708]  = { index = 22, },               -- 横扫攻击
    [107574]  = { index = 23, },               -- 天神下凡
    [190411]  = { index = 24, },               -- 旋风斩
    [5308]    = { index = 25, },               -- 斩杀
    [23881]   = { index = 26, },               -- 嗜血
    [184367]  = { index = 27, },               -- 暴怒
    [385059]  = { index = 28, },               -- 奥丁之怒
    [85288]   = { index = 29, },               -- 怒击
    [6343]    = { index = 30, },               -- 雷霆一击
    [435222]  = { index = 31, },               -- 雷霆轰击
    [6572]    = { index = 32, },               -- 复仇
    [23922]   = { index = 33, },               -- 盾牌猛击
    [163201]  = { index = 34, },               -- 斩杀
    [1269383] = { index = 35, },               -- 英勇打击
    -- 死亡骑士
    [51052]   = { index = 1, failed = true },  -- 反魔法领域
    [221562]  = { index = 2, failed = true },  -- 窒息
    [207167]  = { index = 3, failed = true },  -- 致盲冰雨
    [42650]   = { index = 4, failed = true },  -- 亡者大军
    [206930]  = { index = 5, },                -- 心脏打击
    [43265]   = { index = 6, },                -- 枯萎凋零
    [195292]  = { index = 7, },                -- 死神的抚摸
    [49998]   = { index = 8, },                -- 灵界打击
    [49028]   = { index = 9, },                -- 符文刃舞
    [195182]  = { index = 10, },               -- 精髓分裂
    [50842]   = { index = 11, },               -- 血液沸腾
    [433895]  = { index = 12, },               -- 吸血鬼打击
    [46584]   = { index = 13, },               -- 亡者复生
    [47541]   = { index = 14, },               -- 凋零缠绕
    [55090]   = { index = 15, },               -- 天灾打击
    [207317]  = { index = 16, },               -- 扩散
    [77575]   = { index = 17, },               -- 爆发
    [85948]   = { index = 18, },               -- 脓疮打击
    [1247378] = { index = 19, },               -- 腐化
    [1233448] = { index = 20, },               -- 黑暗突变
    [343294]  = { index = 21, },               -- 灵魂收割
    [458128]  = { index = 22, },               -- 脓疮毒镰
    -- 猎人
    [217200]  = { index = 1, },                -- 倒刺射击
    [34026]   = { index = 2, },                -- 杀戮命令
    [193455]  = { index = 3, },                -- 眼镜蛇射击
    [19574]   = { index = 4, },                -- 狂野怒火
    [201430]  = { index = 5, },                -- 荒野呼唤
    [131894]  = { index = 6, },                -- 夺命黑鸦
    [120360]  = { index = 7, },                -- 弹幕射击
    [321530]  = { index = 8, },                -- 血溅十方
    [19434]   = { index = 9, },                -- 瞄准射击
    [257044]  = { index = 10, },               -- 急速射击
    [56641]   = { index = 11, },               -- 稳固射击
    [2643]    = { index = 12, },               -- 多重射击
    [288613]  = { index = 13, },               -- 百发百中
    [53351]   = { index = 14, },               -- 夺命射击
    [212431]  = { index = 15, },               -- 爆炸射击
    [389831]  = { index = 16, },               -- 哀恸箭
    [257284]  = { index = 17, },               -- 猎人印记
    [185358]  = { index = 18, },               -- 奥术射击
    [342049]  = { index = 19, },               -- 奇美拉射击
    [883]     = { index = 20, },               -- 召唤宠物1
    [1264359] = { index = 21, },               -- 狂野鞭笞

    -- 萨满
    [457481]  = { index = 1, },                -- 唤潮者的护卫
    [382021]  = { index = 2, },                -- 大地生命武器
    [462854]  = { index = 3, },                -- 天怒
    [52127]   = { index = 4, },                -- 水之护盾
    [470411]  = { index = 5, },                -- 烈焰震击
    [51505]   = { index = 6, },                -- 熔岩爆裂
    [188196]  = { index = 7, },                -- 闪电箭
    [188443]  = { index = 8, },                -- 闪电链
    [5394]    = { index = 9, },                -- 治疗之泉图腾
    [57994]   = { index = 10, },               -- 风剪
    [443454]  = { index = 11, },               -- 先祖迅捷
    [378081]  = { index = 12, },               -- 自然迅捷
    [444995]  = { index = 13, failed = true }, -- 涌动图腾
    [192058]  = { index = 14, failed = true }, -- 电能图腾
    [192063]  = { index = 15, failed = true }, -- 阵风
    [98008]   = { index = 16, failed = true }, -- 灵魂链接图腾
    [198103]  = { index = 17, failed = true }, -- 土元素
    [8143]    = { index = 18, failed = true }, -- 战栗图腾
    [383013]  = { index = 19, failed = true }, -- 清毒图腾
    [108287]  = { index = 20, failed = true }, -- 图腾投射
    [114052]  = { index = 21, failed = true }, -- 升腾
    [108280]  = { index = 22, failed = true }, -- 治疗之潮图腾
    [187874]  = { index = 23, },               -- 毁灭闪电
    [470057]  = { index = 24, },               -- 流电炽焰
    [318038]  = { index = 25, },               -- 火舌武器
    [60103]   = { index = 26, },               -- 熔岩猛击
    [197214]  = { index = 27, },               -- 裂地术
    [1218090] = { index = 28, },               -- 始源风暴
    [115356]  = { index = 29, },               -- 风切
    [33757]   = { index = 30, },               -- 风怒武器
    [17364]   = { index = 31, },               -- 风暴打击
    [452201]  = { index = 32, },               -- 狂风怒号
    [117014]  = { index = 33, },               -- 元素冲击
    [462620]  = { index = 34, },               -- 地震术
    [8042]    = { index = 35, },               -- 大地震击
    [191634]  = { index = 36, },               -- 风暴守护者
    [192106]  = { index = 37, },               -- 闪电之盾
    [77472]   = { index = 38, },               -- 治疗波
    [1064]    = { index = 39, },               -- 治疗链
    [61295]   = { index = 40, },               -- 激流
    [974]     = { index = 41, },               -- 大地之盾
    [77130]   = { index = 42, },               -- 净化灵魂
    [73685]   = { index = 43, },               -- 生命释放
}
