local addon, ns = ...

Fuyutsui.spellsList = {
    [384255]  = { index = 151, },              -- 切换天赋
    [200749]  = { index = 152, },              -- 切换专精
    -- 种族
    [59547]   = { index = 122, },              -- 纳鲁的赐福
    [28730]   = { index = 101, },              -- 奥术洪流(法师)
    [232633]  = { index = 101, },              -- 奥术洪流(牧师)
    [129597]  = { index = 101, },              -- 奥术洪流(武僧)
    -- 术士
    [5782]    = { index = 1, failed = true },  -- 恐惧
    [6789]    = { index = 2, failed = true },  -- 死亡缠绕
    [30283]   = { index = 3, failed = true },  -- 暗影之怒
    [196277]  = { index = 4, failed = true },  -- 内爆
    [265187]  = { index = 5, failed = true },  -- 召唤恶魔暴君
    [1276467] = { index = 6, failed = true },  -- 魔典：邪能破坏者
    [1276672] = { index = 7, },                -- 召唤末日守卫
    [105174]  = { index = 8, },                -- 古尔丹之手
    [104316]  = { index = 9, },                -- 召唤恐惧猎犬
    [30146]   = { index = 10, },               -- 召唤恶魔卫士
    [264178]  = { index = 11, },               -- 恶魔之箭
    [686]     = { index = 12, },               -- 暗影箭
    [691]     = { index = 13, },               -- 召唤地狱猎犬
    [688]     = { index = 14, },               -- 召唤小鬼
    [1271748] = { index = 15, },               -- 虚弱灾厄
    [1271802] = { index = 16, },               -- 语言灾厄
    [434635]  = { index = 17, },               -- 陨灭(古尔丹之手)
    [434506]  = { index = 18, },               -- 狱火箭(暗影箭)
    [20707]   = { index = 19, },               -- 灵魂石
    [333889]  = { index = 20, },               -- 邪能统御
    [108416]  = { index = 21, },               -- 黑暗契约
    [264187]  = { index = 22, },               -- 恶魔之箭
    [1276452] = { index = 23, },               -- 魔典：小鬼领主
    [132409]  = { index = 24, },               -- 法术封锁
    [388215]  = { index = 25, },               -- 吞噬魔法
    [111440]  = { index = 26, },               -- 爆燃冲刺
    [710]     = { index = 27, },               -- 放逐术
    [334275]  = { index = 28, },               -- 疲劳诅咒
    [1714]    = { index = 29, },               -- 语言诅咒
    [111771]  = { index = 30, },               -- 恶魔传送门
    [385899]  = { index = 31, },               -- 灵魂燃烧
    [5484]    = { index = 32, },               -- 恐惧嚎叫
    [48018]   = { index = 33, },               -- 恶魔法阵
    [48020]   = { index = 34, },               -- 恶魔法阵：传送
    [29893]   = { index = 35, },               -- 制造灵魂之井
    [698]     = { index = 36, },               -- 召唤仪式
    [172]     = { index = 37, },               -- 腐蚀术
    [234153]  = { index = 38, },               -- 吸取生命
    [205180]  = { index = 39, },               -- 召唤黑眼
    [1259790] = { index = 40, },               -- 痛苦无常
    [1257052] = { index = 41, },               -- 幽冥收割
    [27243]   = { index = 42, },               -- 腐蚀之种
    [980]     = { index = 43, },               -- 痛楚
    [48181]   = { index = 44, },               -- 鬼影缠身
    [445468]  = { index = 45, },               -- 枯萎(腐蚀术)
    [442726]  = { index = 46, },               -- 怨毒
    [1122]    = { index = 47, },               -- 召唤地狱火
    [17877]   = { index = 48, },               -- 暗影灼烧
    [116858]  = { index = 49, },               -- 混乱之箭
    [5740]    = { index = 50, },               -- 火焰之雨
    [6353]    = { index = 51, },               -- 灵魂之火
    [29722]   = { index = 52, },               -- 烧尽
    [17962]   = { index = 53, },               -- 燃烧
    [348]     = { index = 54, },               -- 献祭
    [196447]  = { index = 55, },               -- 引导恶魔之火
    [80240]   = { index = 56, },               -- 浩劫
    [1214467] = { index = 57, },               -- 火焰之雨(目标)
    [152108]  = { index = 58, },               -- 大灾变
    [198590]  = { index = 59, },               -- 吸取灵魂
    [697]     = { index = 60, },               -- 召唤虚空行者
    [366222]  = { index = 61, },               -- 召唤萨亚德
    -- 牧师
    [8122]    = { index = 1, failed = true },  -- 心灵尖啸
    [32375]   = { index = 2, failed = true },  -- 群体驱散
    [62618]   = { index = 3, failed = true },  -- 真言术：障
    [421453]  = { index = 4, failed = true },  -- 终极苦修
    [200183]  = { index = 5, failed = true },  -- 神圣化身
    [120517]  = { index = 6, failed = true },  -- 光晕
    [64843]   = { index = 7, failed = true },  -- 神圣赞美诗
    [228260]  = { index = 8, failed = true },  -- 虚空形态
    [15286]   = { index = 9, failed = true },  -- 吸血鬼的拥抱
    [21562]   = { index = 10, },               -- 真言术：韧
    [8092]    = { index = 11, },               -- 心灵震爆
    [585]     = { index = 12, },               -- 惩击
    [32379]   = { index = 13, },               -- 暗言术：灭
    [589]     = { index = 14, },               -- 暗言术：痛
    [47540]   = { index = 15, },               -- 苦修
    [47757]   = { index = 15, },               -- 苦修
    [47758]   = { index = 15, },               -- 苦修
    [88625]   = { index = 16, },               -- 圣言术：罚
    [14914]   = { index = 17, },               -- 神圣之火
    [132157]  = { index = 18, },               -- 神圣新星
    [34914]   = { index = 19, },               -- 吸血鬼之触
    [232698]  = { index = 20, },               -- 暗影形态
    [335467]  = { index = 21, },               -- 暗言术：癫
    [15407]   = { index = 22, },               -- 精神鞭笞
    [263165]  = { index = 23, },               -- 虚空洪流
    [1227280] = { index = 24, },               -- 触须猛击
    [450983]  = { index = 25, },               -- 虚空冲击
    [1242173] = { index = 26, },               -- 虚空齐射
    [391403]  = { index = 27, },               -- 精神鞭笞：狂
    [120644]  = { index = 28, },               -- 光晕
    [2061]    = { index = 29, },               -- 快速治疗
    [194509]  = { index = 30, failed = true }, -- 真言术：耀
    [64863]   = { index = 31, },               -- 神圣赞美诗
    [596]     = { index = 32, },               -- 治疗祷言
    [1262763] = { index = 33, },               -- 祈福
    [186263]  = { index = 34, },               -- 暗影愈合
    [472433]  = { index = 35, failed = true }, -- 福音
    -- 德鲁伊
    [132469]  = { index = 1, failed = true },  -- 台风
    [99]      = { index = 2, failed = true },  -- 夺魂咆哮
    [102793]  = { index = 3, failed = true },  -- 乌索尔旋风
    [132158]  = { index = 4 },                 -- 自然迅捷
    [8921]    = { index = 5, },                -- 月火术
    [1126]    = { index = 6, },                -- 野性印记
    [400254]  = { index = 7, },                -- 摧折
    [204066]  = { index = 8, },                -- 明月普照
    [213771]  = { index = 9, },                -- 横扫
    [5487]    = { index = 10, },               -- 熊形态
    [77758]   = { index = 11, },               -- 痛击
    [33917]   = { index = 12, },               -- 裂伤
    [1252871] = { index = 13, },               -- 赤红之月
    [441605]  = { index = 14, },               -- 毁灭
    [22568]   = { index = 15, },               -- 凶猛撕咬
    [1079]    = { index = 16, },               -- 割裂
    [5221]    = { index = 17, },               -- 撕碎
    [1822]    = { index = 18, },               -- 斜掠
    [5176]    = { index = 19, },               -- 愤怒
    [8936]    = { index = 20, },               -- 愈合
    [48438]   = { index = 21, },               -- 野性生长
    [740]     = { index = 22, },               -- 宁静
    [190984]  = { index = 23, },               -- 愤怒
    [78674]   = { index = 24, },               -- 星涌术
    [194153]  = { index = 25, },               -- 星火术
    [391528]  = { index = 26, },               -- 万灵之召
    [191034]  = { index = 27, },               -- 星辰坠落
    [205636]  = { index = 28, },               -- 自然之力
    [1233346] = { index = 29, },               -- 日蚀
    [194223]  = { index = 30, },               -- 超凡之盟
    [78675]   = { index = 31, failed = true }, -- 日光术
    [102560]  = { index = 32, },               -- 化身：艾露恩之眷
    [202770]  = { index = 33, },               -- 艾露恩之怒
    [274281]  = { index = 34, },               -- 新月
    [24858]   = { index = 35, },               -- 枭兽形态
    [93402]   = { index = 36, },               -- 阳炎术
    [1233272] = { index = 37, },               -- 月蚀
    [768]     = { index = 38, },               -- 猎豹形态
    [102543]  = { index = 39, },               -- 化身：阿莎曼之灵
    [285381]  = { index = 40, },               -- 原始之怒
    [106839]  = { index = 41, },               -- 迎头痛击
    [1243807] = { index = 42, },               -- 怒意狂乱
    [5217]    = { index = 43, },               -- 猛虎之怒
    [61336]   = { index = 44, },               -- 生存本能
    [102401]  = { index = 45, },               -- 野性冲锋
    [102359]  = { index = 46, },               -- 群体缠绕
    [106951]  = { index = 47, },               -- 狂暴
    [1244258] = { index = 48, },               -- 啃噬
    [274837]  = { index = 49, },               -- 野性狂乱
    [106785]  = { index = 50, },               -- 横扫
    [441591]  = { index = 51, },               -- 毁灭
    [1253799] = { index = 52, },               -- 碎甲咆哮
    [6807]    = { index = 53, },               -- 重殴
    [1261867] = { index = 54, },               -- 野性之心
    [93985]   = { index = 55, },               -- 迎头痛击
    [314330]  = { index = 56, },               -- 迎头痛击
    [192081]  = { index = 57, },               -- 铁鬃
    [1270292] = { index = 58, },               -- 明月普照
    [22812]   = { index = 59, },               -- 树皮术
    [2908]    = { index = 60, },               -- 安抚
    [1850]    = { index = 61, },               -- 急奔
    [339]     = { index = 62, },               -- 纠缠根须
    [2782]    = { index = 63, },               -- 清除腐蚀
    [6795]    = { index = 64, },               -- 低吼
    [77761]   = { index = 65, },               -- 狂奔怒吼
    [783]     = { index = 66, },               -- 旅行形态
    [102558]  = { index = 67, },               -- 化身：乌索克的守护者
    [77764]   = { index = 68, },               -- 狂奔怒吼
    -- 法师
    [45438]   = { index = 1, },                -- 寒冰屏障
    [475]     = { index = 2, },                -- 解除诅咒
    [110960]  = { index = 3, },                -- 强化隐形术
    [157980]  = { index = 4, },                -- 超级新星
    [120]     = { index = 5, },                -- 冰锥术
    [342247]  = { index = 6, },                -- 操控时间
    [371817]  = { index = 7, },                -- 回归
    [80353]   = { index = 8, },                -- 时间扭曲
    [55342]   = { index = 9, },                -- 镜像
    [2139]    = { index = 10, },               -- 法术反制
    [1953]    = { index = 11, },               -- 闪现术
    [130]     = { index = 12, },               -- 缓落术
    [1449]    = { index = 13, },               -- 魔爆术
    [157997]  = { index = 14, },               -- 寒冰新星
    [212653]  = { index = 15, },               -- 闪光术
    [62388]   = { index = 16, },               -- 传送距离
    [389713]  = { index = 17, },               -- 闪回
    [110959]  = { index = 18, failed = true }, -- 强化隐形术
    [122]     = { index = 19, failed = true }, -- 冰霜新星
    [31661]   = { index = 20, failed = true }, -- 龙息术
    [414664]  = { index = 21, },               -- 群体隐形
    [30449]   = { index = 22, },               -- 法术吸取
    [1248829] = { index = 23, },               -- 暴风雪
    [190356]  = { index = 24, },               -- 暴风雪
    [1459]    = { index = 25, },               -- 奥术智慧
    [116]     = { index = 26, },               -- 寒冰箭
    [199786]  = { index = 27, },               -- 冰川尖刺
    [30455]   = { index = 28, },               -- 冰枪术
    [205021]  = { index = 29, },               -- 冰霜射线
    [44614]   = { index = 30, },               -- 冰风暴
    [84714]   = { index = 31, },               -- 寒冰宝珠
    [431044]  = { index = 32, },               -- 霜火之箭
    [153595]  = { index = 33, },               -- 彗星风暴
    [235215]  = { index = 34, },               -- 急速冷却
    [235450]  = { index = 35, },               -- 棱光护体
    [1241462] = { index = 36, },               -- 奥术脉冲
    [44425]   = { index = 37, },               -- 奥术弹幕
    [321507]  = { index = 38, },               -- 大法师之触
    [5143]    = { index = 39, },               -- 奥术飞弹
    [30451]   = { index = 40, },               -- 奥术冲击
    [153626]  = { index = 41, },               -- 奥术宝珠
    [365350]  = { index = 42, },               -- 奥术涌动
    [235313]  = { index = 43, },               -- 烈焰护体
    [414658]  = { index = 44, },               -- 深寒凝冰
    [190319]  = { index = 45, },               -- 燃烧
    [153561]  = { index = 46, },               -- 流星
    [133]     = { index = 47, },               -- 火球术
    [108853]  = { index = 48, },               -- 火焰冲击
    [11366]   = { index = 49, },               -- 炎爆术
    [1254851] = { index = 50, },               -- 烈焰风暴
    [118]     = { index = 51, },               -- 变形术
    [468655]  = { index = 52, },               -- 霜火之箭
    [2120]    = { index = 53, },               -- 烈焰风暴
    [2948]    = { index = 54, },               -- 灼烧
    [190336]  = { index = 55, },               -- 造餐术
    -- 圣骑士
    [115750]  = { index = 1, failed = true },  -- 盲目之光
    [31821]   = { index = 2, failed = true },  -- 光环掌握
    [1044]    = { index = 3, failed = true },  -- 自由祝福
    [853]     = { index = 4, failed = true },  -- 制裁之锤
    [1022]    = { index = 5, failed = true },  -- 保护祝福
    [642]     = { index = 6, failed = true },  -- 圣盾术
    [375576]  = { index = 7, failed = true },  -- 圣洁鸣钟
    [31935]   = { index = 8, },                -- 复仇者之盾
    [26573]   = { index = 9, },                -- 奉献
    [275779]  = { index = 10, },               -- 审判
    [53600]   = { index = 11, },               -- 正义盾击
    [204019]  = { index = 12, },               -- 祝福之锤
    [184575]  = { index = 13, },               -- 公正之剑
    [20271]   = { index = 14, },               -- 审判
    [383328]  = { index = 15, },               -- 最终审判
    [255937]  = { index = 16, failed = true }, -- 灰烬觉醒
    [53385]   = { index = 17, },               -- 神圣风暴
    [427453]  = { index = 18, },               -- 圣光之锤(灰烬觉醒, 圣洁鸣钟)
    [24275]   = { index = 19, },               -- 愤怒之锤(审判)
    [343527]  = { index = 20, },               -- 处决宣判
    [1241413] = { index = 21, },               -- 愤怒之锤(审判)
    [82326]   = { index = 22, },               -- 圣光术
    [19750]   = { index = 23, },               -- 圣光闪现
    [200025]  = { index = 24, failed = true }, -- 美德道标
    [114165]  = { index = 25, },               -- 神圣棱镜
    [53595]   = { index = 26, },               -- 正义之锤
    -- 武僧
    [322109]  = { index = 1, failed = true },  -- 轮回之触
    [119381]  = { index = 2, failed = true },  -- 扫堂腿
    [101643]  = { index = 3, failed = true },  -- 魂体双分
    [119996]  = { index = 4, failed = true },  -- 转移
    [115310]  = { index = 5, failed = true },  -- 还魂术
    [116844]  = { index = 6, failed = true },  -- 平心之环
    [115078]  = { index = 7, failed = true },  -- 分筋错骨
    [132578]  = { index = 8, failed = true },  -- 玄牛下凡
    [100780]  = { index = 9, },               -- 猛虎掌
    [322729]  = { index = 10, },               -- 神鹤引项踢
    [205523]  = { index = 11, },               -- 幻灭踢
    [325153]  = { index = 12, },               -- 爆炸酒桶
    [123986]  = { index = 13, },               -- 真气爆裂
    [121253]  = { index = 14, },               -- 醉酿投
    [115181]  = { index = 15, },               -- 火焰之息
    [116847]  = { index = 16, },               -- 碧玉疾风
    [117952]  = { index = 17, },               -- 碎玉闪电
    [101546]  = { index = 18, },               -- 神鹤引项踢
    [100784]  = { index = 19, },               -- 幻灭踢
    [113656]  = { index = 20, },               -- 怒雷破
    [107428]  = { index = 21, },               -- 旭日东升踢
    [392983]  = { index = 22, },               -- 风领主之击
    [467307]  = { index = 23, },               -- 疾风呼啸踢
    [152175]  = { index = 24, },               -- 升龙霸
    [399491]  = { index = 25, },               -- 神龙之赐
    [116670]  = { index = 26, },               -- 活血术
    [115175]  = { index = 27, },               -- 抚慰之雾
    [443028]  = { index = 28, },               -- 天神御身
    [124682]  = { index = 29, },               -- 氤氲之雾
    [115294]  = { index = 30, },               -- 法力茶
    -- 战士
    [202168]  = { index = 1, failed = true },  -- 胜利在望
    [376079]  = { index = 2, failed = true },  -- 勇士之矛
    [6544]    = { index = 3, failed = true },  -- 英勇飞跃
    [97462]   = { index = 4, failed = true },  -- 集结呐喊
    [46968]   = { index = 5, failed = true },  -- 震荡波
    [107570]  = { index = 6, failed = true },  -- 风暴之锤
    [384110]  = { index = 7, failed = true },  -- 破裂投掷
    [64382]   = { index = 8, failed = true },  -- 碎裂投掷
    [5246]    = { index = 9, failed = true },  -- 破胆怒吼
    [385952]  = { index = 10, failed = true }, -- 盾牌冲锋
    [57755]   = { index = 11, },               -- 英勇投掷
    [6673]    = { index = 12, },               -- 战斗怒吼
    [1464]    = { index = 13, },               -- 猛击
    [772]     = { index = 14, },               -- 撕裂
    [281000]  = { index = 15, },               -- 斩杀
    [227847]  = { index = 16, },               -- 剑刃风暴
    [436358]  = { index = 17, },               -- 崩摧
    [12294]   = { index = 18, },               -- 致死打击
    [167105]  = { index = 19, },               -- 巨人打击
    [845]     = { index = 20, },               -- 顺劈斩
    [7384]    = { index = 21, },               -- 压制
    [260708]  = { index = 22, },               -- 横扫攻击
    [107574]  = { index = 23, },               -- 天神下凡
    [190411]  = { index = 24, },               -- 旋风斩
    [5308]    = { index = 25, },               -- 斩杀
    [23881]   = { index = 26, },               -- 嗜血
    [184367]  = { index = 27, },               -- 暴怒
    [385059]  = { index = 28, },               -- 奥丁之怒
    [85288]   = { index = 29, },               -- 怒击
    [6343]    = { index = 30, },               -- 雷霆一击
    [435222]  = { index = 31, },               -- 雷霆轰击
    [6572]    = { index = 32, },               -- 复仇
    [23922]   = { index = 33, },               -- 盾牌猛击
    [163201]  = { index = 34, },               -- 斩杀
    [1269383] = { index = 35, },               -- 英勇打击
    [335096]  = { index = 36, },               -- 浴血奋战
    [335100]  = { index = 37, },               -- 碎甲猛击
    [228920]  = { index = 38, },               -- 破坏者
    [280735]  = { index = 39, },               -- 斩杀（点了屠杀天赋）
    -- 死亡骑士
    [51052]   = { index = 1, failed = true },  -- 反魔法领域
    [221562]  = { index = 2, failed = true },  -- 窒息
    [207167]  = { index = 3, failed = true },  -- 致盲冰雨
    [42650]   = { index = 4, failed = true },  -- 亡者大军
    [206930]  = { index = 5, },                -- 心脏打击
    [43265]   = { index = 6, },                -- 枯萎凋零
    [195292]  = { index = 7, },                -- 死神的抚摸
    [49998]   = { index = 8, },                -- 灵界打击
    [49028]   = { index = 9, },                -- 符文刃舞
    [195182]  = { index = 10, },               -- 精髓分裂
    [50842]   = { index = 11, },               -- 血液沸腾
    [433895]  = { index = 12, },               -- 吸血鬼打击
    [46584]   = { index = 13, },               -- 亡者复生
    [47541]   = { index = 14, },               -- 凋零缠绕
    [55090]   = { index = 15, },               -- 天灾打击
    [207317]  = { index = 16, },               -- 扩散
    [77575]   = { index = 17, },               -- 爆发
    [85948]   = { index = 18, },               -- 脓疮打击
    [1247378] = { index = 19, },               -- 腐化
    [1233448] = { index = 20, },               -- 黑暗突变
    [343294]  = { index = 21, },               -- 灵魂收割
    [458128]  = { index = 22, },               -- 脓疮毒镰
    [108199]  = { index = 23, failed = true }, -- 血魔之握
    [1263569] = { index = 24, failed = true }, -- 憎恶附肢
    [439843]  = { index = 25, },               -- 死神印记
    [194913]  = { index = 26, },               -- 冰川突进
    [279302]  = { index = 27, },               -- 冰霜巨龙之怒
    [196770]  = { index = 28, },               -- 冷酷严冬
    [51271]   = { index = 29, },               -- 冰霜之柱
    [49143]   = { index = 30, },               -- 冰霜打击
    [49184]   = { index = 31, },               -- 凛风冲击
    [207230]  = { index = 32, },               -- 冰霜之镰
    [1249685] = { index = 33, },               -- 冰龙吐息
    [49020]   = { index = 34, },               -- 湮灭
    [47568]   = { index = 35, },               -- 符文武器增效
    [316239]  = { index = 36, },               -- 符文打击
    [1265384] = { index = 37, },               -- 冰霜巨龙之怒
    [1228433] = { index = 38, },               -- 冰霜灾祸
    [49576]   = { index = 39, failed = true }, -- 死亡之握
    [1263824] = { index = 40 },                -- 吞噬
    [383269]  = { index = 41 },                -- 灾殃坟茔
    [1242174] = { index = 42 },                -- 死灵缠绕
    -- 猎人
    [217200]  = { index = 1, },                -- 倒刺射击
    [34026]   = { index = 2, },                -- 杀戮命令
    [193455]  = { index = 3, },                -- 眼镜蛇射击
    [19574]   = { index = 4, },                -- 狂野怒火
    [201430]  = { index = 5, },                -- 荒野呼唤
    [131894]  = { index = 6, },                -- 夺命黑鸦
    [120360]  = { index = 7, },                -- 弹幕射击
    [321530]  = { index = 8, },                -- 血溅十方
    [19434]   = { index = 9, },                -- 瞄准射击
    [257044]  = { index = 10, },               -- 急速射击
    [56641]   = { index = 11, },               -- 稳固射击
    [2643]    = { index = 12, },               -- 多重射击
    [288613]  = { index = 13, },               -- 百发百中
    [53351]   = { index = 14, },               -- 夺命射击
    [212431]  = { index = 15, },               -- 爆炸射击
    [389831]  = { index = 16, },               -- 哀恸箭
    [257284]  = { index = 17, },               -- 猎人印记
    [185358]  = { index = 18, },               -- 奥术射击
    [342049]  = { index = 19, },               -- 奇美拉射击
    [883]     = { index = 20, },               -- 召唤宠物1
    [1264359] = { index = 21, },               -- 狂野鞭笞
    [109304]  = { index = 22, failed = true }, -- 意气风发
    [186265]  = { index = 23, },               -- 灵龟守护
    [147362]  = { index = 24, },               -- 反制射击
    [392060]  = { index = 25, },               -- 哀恸箭
    [466930]  = { index = 26, },               -- 黑蚀箭
    [19577]   = { index = 27, failed = true }, -- 胁迫
    [260243]  = { index = 28, },               -- 乱射
    [257620]  = { index = 29, },               -- 多重射击
    [259489]  = { index = 30, },               -- 杀戮命令
    [193265]  = { index = 31, },               -- 投掷手斧
    [1251592] = { index = 32, },               -- 燎焰沥青
    [1261193] = { index = 33, },               -- 爆裂火铳
    [1250646] = { index = 34, },               -- 狩魂一击
    [190925]  = { index = 35, },               -- 鱼叉猛刺
    [186270]  = { index = 36, },               -- 猛禽一击
    [259495]  = { index = 37, },               -- 野火炸弹
    [53480]   = { index = 38, },               -- 牺牲咆哮
    [5116]    = { index = 39, failed = true }, -- 震荡射击
    [19801]   = { index = 40, failed = true }, -- 宁神射击
    [187698]  = { index = 41, failed = true }, -- 焦油陷进
    [1513]    = { index = 42, failed = true }, -- 恐吓野兽
    [109248]  = { index = 43, failed = true }, -- 束缚射击
    [199483]  = { index = 44, },               -- 伪装
    [195645]  = { index = 45, failed = true }, -- 摔绊
    [1262293] = { index = 46, },               -- 猛禽横扫
    -- 恶魔猎手
    [198793]  = { index = 1, },                -- 复仇回避
    [185123]  = { index = 2, },                -- 投掷利刃
    [207684]  = { index = 3, failed = true },  -- 悲苦咒符
    [217832]  = { index = 4 },                 -- 禁锢
    [258920]  = { index = 5, },                -- 献祭光环
    [179057]  = { index = 6, failed = true },  -- 混乱新星
    [191427]  = { index = 7, },                -- 恶魔变形
    [232893]  = { index = 8, },                -- 邪能之刃
    [188499]  = { index = 9, },                -- 刃舞
    [162794]  = { index = 10, },               -- 混乱打击
    [198589]  = { index = 11, },               -- 疾影
    [370965]  = { index = 12, },               -- 恶魔追击
    [198013]  = { index = 13, },               -- 眼棱
    [195072]  = { index = 14, },               -- 邪能冲撞
    [258860]  = { index = 15, },               -- 精华破碎
    [187827]  = { index = 16, failed = true }, -- 恶魔变形
    [189110]  = { index = 17, },               -- 地狱火撞击
    [203720]  = { index = 18, },               -- 恶魔尖刺
    [204021]  = { index = 19 },                -- 烈火烙印
    [247454]  = { index = 20, },               -- 幽魂炸弹
    [207407]  = { index = 21, },               -- 灵魂切削
    [204596]  = { index = 22, },               -- 烈焰咒符
    [390163]  = { index = 23, },               -- 怨念咒符
    [228477]  = { index = 24, },               -- 灵魂裂劈
    [263642]  = { index = 25, },               -- 破裂
    [212084]  = { index = 26, failed = true }, -- 邪能毁灭
    [202137]  = { index = 27, failed = true }, -- 沉默咒符
    [1234195] = { index = 28, failed = true }, -- 虚空新星
    [1217605] = { index = 29, },               -- 虚空变形
    [1245412] = { index = 30, },               -- 虚空之刃
    [1234796] = { index = 31, },               -- 变换
    [1226019] = { index = 32, },               -- 收割
    [473662]  = { index = 33, },               -- 吞噬
    [473728]  = { index = 34, },               -- 虚空射线
    [1246167] = { index = 35, },               -- 恶魔追击
    [1239123] = { index = 36, },               -- 饥渴斩击
    [1245453] = { index = 37, },               -- 剔除
    [201427]  = { index = 38, },               -- 毁灭(混乱打击)
    [210152]  = { index = 39, },               -- 死亡横扫(刃舞)
    [452487]  = { index = 40, },               -- 吞噬之焰(献祭光环)
    [427917]  = { index = 41, },               -- 献祭光环
    [204157]  = { index = 42, },               -- 投掷利刃
    [196718]  = { index = 43, failed = true }, -- 黑暗
    [1217610] = { index = 44, },               -- 吞噬(虚空变形)
    [1221150] = { index = 45 },                -- 坍缩之星
    [1225826] = { index = 46, },               -- 根除
    [1241937] = { index = 47, },               -- 灵魂献祭
    [452497]  = { index = 48, },               -- 深渊凝视(眼棱)
    [213243]  = { index = 49, },               -- 邪能之刃
    [227518]  = { index = 50, },               -- 毁灭
    [201428]  = { index = 51, },               -- 毁灭
    [222031]  = { index = 52, },               -- 混乱打击
    [199547]  = { index = 53, },               -- 混乱打击
    [201453]  = { index = 54, },               -- 恶魔变形
    [200166]  = { index = 55, },               -- 恶魔变形
    [456640]  = { index = 56, },               -- 吞噬之焰
    -- 萨满
    [457481]  = { index = 1, },                -- 唤潮者的护卫
    [382021]  = { index = 2, },                -- 大地生命武器
    [462854]  = { index = 3, },                -- 天怒
    [52127]   = { index = 4, },                -- 水之护盾
    [470411]  = { index = 5, },                -- 烈焰震击
    [51505]   = { index = 6, },                -- 熔岩爆裂
    [188196]  = { index = 7, },                -- 闪电箭
    [188443]  = { index = 8, },                -- 闪电链
    [5394]    = { index = 9, },                -- 治疗之泉图腾
    [57994]   = { index = 10, },               -- 风剪
    [443454]  = { index = 11, },               -- 先祖迅捷
    [378081]  = { index = 12, },               -- 自然迅捷
    [444995]  = { index = 13, failed = true }, -- 涌动图腾
    [192058]  = { index = 14, failed = true }, -- 电能图腾
    [192063]  = { index = 15, failed = true }, -- 阵风
    [98008]   = { index = 16, failed = true }, -- 灵魂链接图腾
    [198103]  = { index = 17, failed = true }, -- 土元素
    [8143]    = { index = 18, failed = true }, -- 战栗图腾
    [383013]  = { index = 19, failed = true }, -- 清毒图腾
    [108287]  = { index = 20, failed = true }, -- 图腾投射
    [114052]  = { index = 21, failed = true }, -- 升腾
    [108280]  = { index = 22, failed = true }, -- 治疗之潮图腾
    [187874]  = { index = 23, },               -- 毁灭闪电
    [470057]  = { index = 24, },               -- 流电炽焰
    [318038]  = { index = 25, },               -- 火舌武器
    [60103]   = { index = 26, },               -- 熔岩猛击
    [197214]  = { index = 27, },               -- 裂地术
    [1218090] = { index = 28, },               -- 始源风暴
    [115356]  = { index = 29, },               -- 风切
    [33757]   = { index = 30, },               -- 风怒武器
    [17364]   = { index = 31, },               -- 风暴打击
    [452201]  = { index = 32, },               -- 狂风怒号
    [117014]  = { index = 33, },               -- 元素冲击
    [462620]  = { index = 34, },               -- 地震术
    [8042]    = { index = 35, },               -- 大地震击
    [191634]  = { index = 36, },               -- 风暴守护者
    [192106]  = { index = 37, },               -- 闪电之盾
    [77472]   = { index = 38, },               -- 治疗波
    [1064]    = { index = 39, },               -- 治疗链
    [61295]   = { index = 40, },               -- 激流
    [974]     = { index = 41, },               -- 大地之盾
    [77130]   = { index = 42, },               -- 净化灵魂
    [73685]   = { index = 43, },               -- 生命释放
    [1267068] = { index = 44, },               -- 风暴涌流图腾
    [73920]   = { index = 45, failed = true }, -- 治疗之雨
    [462603]  = { index = 46 },                -- 倾盆大雨
    [192077]  = { index = 47, failed = true }, -- 狂风图腾
    [456366]  = { index = 48, },               -- 治疗之雨
    [79206]   = { index = 49, },               -- 灵魂行者的恩赐
    [108271]  = { index = 50, },               -- 星界转移
    [2645]    = { index = 51, },               -- 幽魂之狼
    [370]     = { index = 50, },               -- 净化术
    [378773]  = { index = 51, },               -- 强效净化术
    -- 唤魔师
    [365585]  = { index = 1, },                -- 净除
    [382266]  = { index = 2, },                -- 火焰吐息
    [364342]  = { index = 3, },                -- 青铜龙的祝福
    [374251]  = { index = 4, },                -- 灼烧之焰
    [363916]  = { index = 5, },                -- 黑曜鳞片
    [358385]  = { index = 6, },                -- 山崩
    [358267]  = { index = 7, },                -- 悬空
    [362969]  = { index = 8, },                -- 碧蓝打击
    [368970]  = { index = 9, },                -- 扫尾
    [355913]  = { index = 10, },               -- 翡翠之花
    [370553]  = { index = 11, },               -- 扭转天平
    [361469]  = { index = 12, },               -- 活化烈焰
    [356995]  = { index = 13, },               -- 裂解
    [357210]  = { index = 14, },               -- 深呼吸
    [360995]  = { index = 15, },               -- 青翠之拥
    [382411]  = { index = 16, },               -- 永恒之涌
    [357211]  = { index = 17, },               -- 葬火
    [375087]  = { index = 18, },               -- 狂龙之怒
    [351338]  = { index = 19, },               -- 镇压
    [360806]  = { index = 20, },               -- 梦游
    [374227]  = { index = 21, },               -- 微风
    [374968]  = { index = 22, },               -- 时间螺旋
    [406732]  = { index = 23, },               -- 空间悖论
    [370665]  = { index = 24, },               -- 营救
    [1265872] = { index = 25, },               -- 碧蓝横扫(碧蓝打击)
    [357208]  = { index = 26, },               -- 火焰吐息
    [359073]  = { index = 27, },               -- 永恒之涌
    -- 盗贼
    [5938]    = { index = 1, },                -- 毒刃
    [2094]    = { index = 2, },                -- 致盲
    [31224]   = { index = 3, },                -- 暗影斗篷
    [1776]    = { index = 4, },                -- 凿击
    [57934]   = { index = 5, },                -- 嫁祸诀窍
    [5277]    = { index = 6, },                -- 闪避
    [5761]    = { index = 7, },                -- 迟钝药膏
    [381637]  = { index = 8, },                -- 萎缩药膏
    [381623]  = { index = 9, },                -- 菊花茶
    [408]     = { index = 10, },               -- 肾击
    [1966]    = { index = 11, },               -- 佯攻
    [1833]    = { index = 12, },               -- 偷袭
    [1856]    = { index = 13, },               -- 消失
    [315496]  = { index = 14, },               -- 切割
    [114018]  = { index = 15, },               -- 潜伏帷幕
    [1725]    = { index = 16, },               -- 扰乱
    [185311]  = { index = 17, },               -- 猩红之瓶
    [2983]    = { index = 18, },               -- 疾跑
    [6770]    = { index = 19, },               -- 闷棍
    [315584]  = { index = 20, },               -- 速效药膏
    [8679]    = { index = 21, },               -- 致伤药膏
    [2823]    = { index = 22, },               -- 夺命药膏
    [381664]  = { index = 23, },               -- 增效药膏
    [3408]    = { index = 24, },               -- 减速药膏
    [51723]   = { index = 25, },               -- 刀扇
    [360194]  = { index = 26, },               -- 死亡印记
    [1293340] = { index = 27, },               -- 死亡印记
    [703]     = { index = 28, },               -- 锁喉
    [185565]  = { index = 29, },               -- 剧毒之刃
    [1943]    = { index = 30, },               -- 割裂
    [1329]    = { index = 31, },               -- 毁伤
    [385627]  = { index = 32, },               -- 君王之灾
    [32645]   = { index = 33, },               -- 毒伤
    [36554]   = { index = 34, },               -- 暗影步
    [1247227] = { index = 35, },               -- 猩红风暴
    [8676]    = { index = 36, },               -- 伏击
    [1766]    = { index = 37, },               -- 脚踢
    [13750]   = { index = 38, },               -- 冲动
    [51690]   = { index = 39, },               -- 影舞步
    [315341]  = { index = 40, },               -- 正中眉心
    [271877]  = { index = 41, },               -- 刀锋冲刺
    [185763]  = { index = 42, },               -- 手枪射击
    [13877]   = { index = 43, },               -- 剑刃乱舞
    [195475]  = { index = 44, },               -- 抓钩
    [1214909] = { index = 45, },               -- 命运骨骰
    [2098]    = { index = 46, },               -- 斩击
    [381989]  = { index = 47, },               -- 时运继延
    [1277933] = { index = 48, },               -- 伺机待发
    [319175]  = { index = 49, },               -- 黑火药
    [280719]  = { index = 50, },               -- 影分身
    [121471]  = { index = 51, },               -- 暗影之刃
    [53]      = { index = 52, },               -- 背刺
    [185313]  = { index = 53, },               -- 暗影之舞
    [197835]  = { index = 54, },               -- 袖剑风暴
    [185438]  = { index = 55, },               -- 暗影打击
    [114014]  = { index = 56, },               -- 飞镖投掷
    [200758]  = { index = 57, },               -- 幽暗之刃(背刺)
    [426591]  = { index = 58, },               -- 赤喉之咬
    [193315]  = { index = 59, },               -- 影袭
    [441776]  = { index = 60, },               -- 致命一击
}

Fuyutsui.e = {
    ["法术冷却"] = "SPELL_UPDATE_COOLDOWN", -- 冷却事件
    ["施法成功"] = "UNIT_SPELLCAST_SUCCEEDED", -- 成功事件
    ["图标改变"] = "SPELL_UPDATE_ICON", -- ICON事件
    ["法术覆盖"] = "COOLDOWN_VIEWER_SPELL_OVERRIDE_UPDATED", -- 法术临时覆盖事件
    ["图标发光显示"] = "SPELL_ACTIVATION_OVERLAY_GLOW_SHOW", -- 图标发光显示
    ["图标发光隐藏"] = "SPELL_ACTIVATION_OVERLAY_GLOW_HIDE", -- 图标发光隐藏
    ["屏幕提示显示"] = "SPELL_ACTIVATION_OVERLAY_SHOW", -- 屏幕提示显示
    ["屏幕提示隐藏"] = "SPELL_ACTIVATION_OVERLAY_HIDE", -- 屏幕提示隐藏
}
-- 英雄天赋
Fuyutsui.heroTalents = {
    -- 战士
    [436358] = 1,  -- 巨神兵
    [444767] = 2,  -- 屠戮者
    [434969] = 3,  -- 山丘领主
    -- 圣骑士
    [431377] = 1,  -- 烈日先驱
    [432459] = 2,  -- 铸光者
    [427445] = 3,  -- 圣殿骑士
    -- 猎人
    [466930] = 1,  -- 黑暗游侠
    [466932] = 1,  -- 黑暗游侠
    [471876] = 2,  -- 猎群领袖
    [1253599] = 3, -- 哨兵
    -- 盗贼
    [457052] = 1,  -- 死亡猎手
    [452536] = 2,  -- 命缚者
    [441146] = 3,  -- 欺诈者
    -- 牧师
    [1248423] = 1, -- 神谕者
    [263165] = 2,  -- 虚空编织者
    [447444] = 2,  -- 虚空编织者
    [120517] = 3,  -- 执政官
    [102644] = 3,  -- 执政官
    -- 死亡骑士
    [439843] = 1,  -- 死亡使者
    [433901] = 2,  -- 萨莱因
    [444005] = 3,  -- 天启骑士
    -- 萨满祭司
    [443450] = 1,  -- 先知
    [454009] = 2,  -- 风暴使者
    [444995] = 3,  -- 图腾祭祀
    [445024] = 3,  -- 图腾祭祀
    -- 法师
    [443739] = 1,  -- 疾咒师
    [448601] = 2,  -- 日怒
    [431044] = 3,  -- 霜火
    -- 术士
    [445486] = 1,  -- 地狱召唤者
    [449614] = 2,  -- 灵魂收割者
    [428514] = 3,  -- 恶魔使徒
    -- 武僧
    [450508] = 1,  -- 祥和宗师
    [450615] = 2,  -- 影踪派
    [443028] = 3,  -- 天神御师
    [123904] = 3,  -- 天神御师
    -- 德鲁伊
    [424058] = 1,  -- 艾露恩钦选者
    [433831] = 2,  -- 丛林守护者
    [441583] = 3,  -- 利爪德鲁伊
    [439528] = 4,  -- 荒野追猎者
    -- 恶魔猎手
    [442290] = 1,  -- 奥达奇收割者
    [452402] = 2,  -- 邪痕枭雄
    [1253304] = 3, -- 歼灭者
    -- 唤魔师
    [1264269] = 1, -- 塑焰者
    [436335] = 2,  -- 鳞长
    [438587] = 2,  -- 鳞长
    [431442] = 2,  -- 时空守卫
}

-- 难度文本
Fuyutsui.difficutlyToText = {
    [1] = "5人本普通", -- Normal (Dungeon)
    [2] = "5人本英雄", -- Heroic (Dungeon)
    [14] = "团本普通", -- Normal (Raid)
    [15] = "团本英雄", -- Heroic (Raid)
    [16] = "团本史诗", -- Mythic (Raid)
    [17] = "团本随机", -- Looking (Raid)
    [23] = "5人本史诗", -- Mythic (Dungeon)
}
-- 首领ID
Fuyutsui.bossID = {
    [0] = 0,     -- 未战斗
    -- 团本
    [3176] = 1,  -- 元首阿福扎恩
    [3177] = 2,  -- 弗拉希乌斯
    [3179] = 3,  -- 陨落之王萨哈达尔
    [3178] = 4,  -- 威厄高尔和艾佐拉克
    [3180] = 5,  -- 光盲先锋军
    [3181] = 6,  -- 宇宙之冕
    [3306] = 7,  -- 奇美鲁斯，未梦之神
    [3182] = 8,  -- 贝洛朗，奥的子嗣
    [3183] = 9,  -- 至暗之夜降临
    [3454] = 10, -- 鲁阿夏尔
    [3459] = 11, -- 索姆贝兰
    [3431] = 12, -- 普雷达萨斯
    [3436] = 13, -- 克拉格平
    -- 大米
    -- 节点希纳斯
    [3328] = 51, -- 核技工程长卡斯雷瑟
    [3332] = 52, -- 核心守卫奈萨拉
    [3333] = 53, -- 洛萨克森
    -- 迈萨拉洞窟
    [3212] = 54, -- 姆罗金和内克拉克斯
    [3213] = 55, -- 沃达扎
    [3214] = 56, -- 拉克图尔，聚魂之器
    -- 风行者之塔
    [3056] = 57, -- 烬晓
    [3057] = 58, -- 被遗弃的二人组
    [3058] = 59, -- 指挥官克罗鲁科
    [3059] = 60, -- 无眠之心
    -- 魔导师平台
    [3071] = 61, -- 奥能金刚库斯托斯
    [3072] = 62, -- 瑟拉奈尔·日鞭
    [3073] = 63, -- 吉美尔鲁斯
    [3074] = 64, -- 迪詹崔乌斯
    -- 执政团之座
    [2065] = 65, -- 晋升者祖拉尔
    [2066] = 66, -- 萨普瑞什
    [2067] = 67, -- 总督奈扎尔
    [2068] = 68, -- 鲁拉
    -- 艾杰斯亚学院
    [2562] = 69, -- 维克萨姆斯
    [2563] = 70, -- 茂林古树
    [2564] = 71, -- 克罗兹
    [2565] = 72, -- 多拉苟萨的回响
    -- 萨隆矿坑
    [1999] = 73, -- 熔炉之主加弗斯特
    [2001] = 74, -- 伊克和科瑞克
    [2000] = 75, -- 天灾领主泰兰努斯
    -- 通天峰
    [1698] = 76, -- 兰吉特
    [1699] = 77, -- 阿拉卡纳斯
    [1700] = 78, -- 鲁克兰
    [1701] = 79, -- 高阶贤者维里克斯
}
-- 能量类型
Fuyutsui.EnumPowerType = {
    ["MANA"] = 0,
    ["RAGE"] = 1,
    ["FOCUS"] = 2,
    ["ENERGY"] = 3,
    ["COMBO_POINTS"] = 4,
    ["RUNES"] = 5,
    ["RUNIC_POWER"] = 6,
    ["SOUL_SHARDS"] = 7,
    ["LUNAR_POWER"] = 8,
    ["HOLY_POWER"] = 9,
    ["MAELSTROM"] = 11,
    ["CHI"] = 12,
    ["INSANITY"] = 13,
    ["BURNING_EMBERS"] = 14,
    ["DEMONIC_FURY"] = 15,
    ["ARCANE_CHARGES"] = 16,
    ["FURY"] = 17,
    ["PAIN"] = 17, -- 痛苦,原 18, 暂时由愤怒["FURY"]代替, 未知BUG
    ["ESSENCE"] = 19,
    ["SHADOW_ORBS"] = 28,
}
-- 专精范围
Fuyutsui.rangeSpecID = {
    -- Death Knight
    [250] = 15,  -- 鲜血
    [251] = 15,  -- 冰霜
    [252] = 15,  -- 邪恶
    [1455] = 15, -- Initial
    -- Demon Hunter
    [577] = 15,  -- 浩劫
    [581] = 15,  -- 复仇
    [1480] = 25, -- 噬灭
    [1456] = 15, -- Initial
    -- Druid
    [102] = 46,  -- 平衡
    [103] = 15,  -- 野性
    [104] = 15,  -- 守护
    [105] = 46,  -- 恢复
    [1447] = 15, -- Initial
    -- Evoker
    [1467] = 30, -- 湮灭
    [1468] = 30, -- 恩护
    [1473] = 30, -- 增辉
    [1465] = 15, -- Initial
    -- Hunter
    [253] = 46,  -- 兽王
    [254] = 46,  -- 射击
    [255] = 15,  -- 生存
    [1448] = 15, -- Initial
    -- Mage
    [62] = 46,   -- 奥术
    [63] = 46,   -- 火焰
    [64] = 46,   -- 冰霜
    [1449] = 15, -- Initial
    -- Monk
    [268] = 10,  -- 酒仙
    [270] = 10,  -- 织雾
    [269] = 10,  -- 踏风
    [1450] = 10, -- Initial
    -- Paladin
    [65] = 30,   -- 神圣
    [66] = 25,   -- 防护
    [70] = 10,   -- 惩戒
    [1451] = 25, -- Initial
    -- Priest
    [256] = 46,  -- 戒律
    [257] = 46,  -- 神圣
    [258] = 46,  -- 暗影
    [1452] = 46, -- Initial
    -- Rogue
    [259] = 15,  -- 刺杀
    [260] = 15,  -- 狂徒
    [261] = 15,  -- 敏锐
    [1453] = 15, -- Initial
    -- Shaman
    [262] = 46,  -- 元素
    [263] = 15,  -- 增强
    [264] = 46,  -- 恢复
    [1444] = 46, -- Initial
    -- Warlock
    [265] = 46,  -- 痛苦
    [266] = 46,  -- 恶魔
    [267] = 46,  -- 毁灭
    [1454] = 46, -- Initial
    -- Warrior
    [71] = 15,   -- 武器
    [72] = 15,   -- 狂怒
    [73] = 15,   -- 防护
    [1446] = 15, -- Initial
}
-- 无秘密值光环
Fuyutsui.noSecretAuras = {
    -- 恩护 唤魔师
    [355941] = true,  -- Dream Breath
    [363502] = true,  -- Dream Flight
    [364343] = true,  -- Echo
    [366155] = true,  -- Reversion
    [367364] = true,  -- Echo Reversion
    [373267] = true,  -- Lifebind
    [376788] = true,  -- Echo Dream Breath
    -- 增辉 唤魔师
    [360827] = true,  -- Blistering Scales
    [395152] = true,  -- Ebon Might
    [410089] = true,  -- Prescience
    [410263] = true,  -- Inferno's Blessing
    [410686] = true,  -- Symbiotic Bloom
    [413984] = true,  -- Shifting Sands
    -- 恢复 德鲁伊
    [774] = true,     -- Rejuv, 回春
    [8936] = true,    -- Regrowth, 愈合
    [33763] = true,   -- Lifebloom, 生命绽放
    [48438] = true,   -- Wild Growth, 野性生长
    [155777] = true,  -- Germination, 萌芽
    -- 戒律 牧师
    [17] = true,      -- 真言术：盾
    [194384] = true,  -- 救赎
    [1253593] = true, -- 虚空护盾
    -- 神圣 牧师
    [139] = true,     -- 恢复
    [41635] = true,   -- 愈合祷言
    [77489] = true,   -- 圣光回响
    -- 织雾 武僧
    [115175] = true,  -- Soothing Mist 抚慰之雾
    [119611] = true,  -- Renewing Mist 复苏之雾
    [124682] = true,  -- Enveloping Mist 氤氲之雾
    [450769] = true,  -- Aspect of Harmony 和谐化身
    -- 恢复 萨满
    [974] = true,
    [383648] = true,  -- Earth Shield 大地之盾
    [61295] = true,   -- Riptide
    -- 神圣 圣骑士
    [53563] = true,   -- Beacon of Light, 圣光道标
    [156322] = true,  -- Eternal Flame, 永恒之火
    [156910] = true,  -- Beacon of Faith, 信仰道标
    [1244893] = true, -- Beacon of the Savior, 救世道标
}
-- 动作条
Fuyutsui.actionBars = {
    { startSlot = 1,   endSlot = 12,  bindingPrefix = "ACTIONBUTTON" },
    { startSlot = 13,  endSlot = 24,  bindingPrefix = "ACTIONBUTTON" },
    { startSlot = 25,  endSlot = 36,  bindingPrefix = "MULTIACTIONBAR3BUTTON" },
    { startSlot = 37,  endSlot = 48,  bindingPrefix = "MULTIACTIONBAR4BUTTON" },
    { startSlot = 49,  endSlot = 60,  bindingPrefix = "MULTIACTIONBAR2BUTTON" },
    { startSlot = 61,  endSlot = 72,  bindingPrefix = "MULTIACTIONBAR1BUTTON" },
    { startSlot = 73,  endSlot = 84,  bindingPrefix = "ACTIONBUTTON" }, -- 战斗姿态, 猫形态, 潜行, 暗影
    { startSlot = 85,  endSlot = 96,  bindingPrefix = "ACTIONBUTTON" }, -- 防御姿态,
    { startSlot = 97,  endSlot = 108, bindingPrefix = "ACTIONBUTTON" }, -- 狂暴姿态, 熊形态
    { startSlot = 109, endSlot = 120, bindingPrefix = "ACTIONBUTTON" }, -- 枭兽形态
    { startSlot = 121, endSlot = 143, bindingPrefix = "ACTIONBUTTON" },
    { startSlot = 145, endSlot = 156, bindingPrefix = "MULTIACTIONBAR5BUTTON" },
    { startSlot = 157, endSlot = 168, bindingPrefix = "MULTIACTIONBAR6BUTTON" },
    { startSlot = 169, endSlot = 180, bindingPrefix = "MULTIACTIONBAR7BUTTON" }
}
-- 按键映射
Fuyutsui.keymap = {
    ["1"] = 49,
    ["2"] = 50,
    ["3"] = 51,
    ["4"] = 52,
    ["5"] = 53,
    ["6"] = 54,
    ["7"] = 55,
    ["8"] = 56,
    ["9"] = 57,
    ["0"] = 48,

    ["F1"] = 112,
    ["F2"] = 113,
    ["F3"] = 114,
    ["F4"] = 115,
    ["F5"] = 116,
    ["F6"] = 117,
    ["F7"] = 118,
    ["F8"] = 119,
    ["F9"] = 120,
    ["F10"] = 121,
    ["F11"] = 122,
    ["F12"] = 123,

    ["Q"] = 81,
    ["W"] = 87,
    ["E"] = 69,
    ["R"] = 82,
    ["T"] = 84,
    ["Y"] = 89,
    ["U"] = 85,
    ["I"] = 73,
    ["O"] = 79,
    ["P"] = 80,
    ["A"] = 65,
    ["S"] = 83,
    ["D"] = 68,
    ["F"] = 70,
    ["G"] = 71,
    ["H"] = 72,
    ["J"] = 74,
    ["K"] = 75,
    ["L"] = 76,
    ["Z"] = 90,
    ["X"] = 88,
    ["C"] = 67,
    ["V"] = 86,
    ["B"] = 66,
    ["N"] = 78,
    ["M"] = 77,

    ["NUMPAD0"] = 96,
    ["NUMPAD1"] = 97,
    ["NUMPAD2"] = 98,
    ["NUMPAD3"] = 99,
    ["NUMPAD4"] = 100,
    ["NUMPAD5"] = 101,
    ["NUMPAD6"] = 102,
    ["NUMPAD7"] = 103,
    ["NUMPAD8"] = 104,
    ["NUMPAD9"] = 105,
    ["NUMPADMULTIPLY"] = 106,
    ["NUMPADPLUS"] = 107,
    ["NUMPADMINUS"] = 109,
    ["NUMPADDECIMAL"] = 110,
    ["NUMPADDIVIDE"] = 111,

    ["N0"] = 96,  -- 0x60
    ["N1"] = 97,  -- 0x61
    ["N2"] = 98,  -- 0x62
    ["N3"] = 99,  -- 0x63
    ["N4"] = 100, -- 0x64
    ["N5"] = 101, -- 0x65
    ["N6"] = 102, -- 0x66
    ["N7"] = 103, -- 0x67
    ["N8"] = 104, -- 0x68
    ["N9"] = 105, -- 0x69
    ["N*"] = 106, -- 0x6A
    ["N+"] = 107, -- 0x6B
    ["N-"] = 109, -- 0x6D
    ["N."] = 110, -- 0x6E
    ["N/"] = 111, -- 0x6F

    ["SPACE"] = 32,
    ["="] = 187,
    ["EQUALS"] = 187, -- WoW可能返回EQUALS而不是=
    ["-"] = 189,
    ["MINUS"] = 189,  -- WoW可能返回MINUS而不是-
    ["["] = 219,
    ["]"] = 221,
    ["\\"] = 220,
    [";"] = 186,
    ["SEMICOLON"] = 186, -- WoW可能返回SEMICOLON而不是;
    ["'"] = 222,
    [","] = 188,
    ["COMMA"] = 188,  -- WoW可能返回COMMA而不是,
    ["."] = 190,
    ["PERIOD"] = 190, -- WoW可能返回PERIOD而不是.
    ["/"] = 191,
}
-- 角色类型映射
Fuyutsui.roleMap = {
    ["TANK"] = 1,
    ["HEALER"] = 2,
    ["DAMAGER"] = 3,
    ["NONE"] = 0,
}
